In [ ]:
'''Question-1'''

In [1]:
import pandas as pd
series1 = pd.Series([4,8,15,16,23,42])
print(series1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
'''Question-2'''

In [2]:
l2 = [(i+1)**2 for i in range(10)]
print(l2)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [3]:
series2 = pd.Series(l2)
print(series2)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

In [ ]:
'''Question-3'''

In [4]:
dct3 = {
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}
df3 = pd.DataFrame(dct3)
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
'''Question-4'''

In [ ]:
'''In Pandas, a DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns). 
It is a highly flexible and efficient data structure for data manipulation and analysis. 
Each column in a DataFrame can be of a different data type, and you can perform various operations on the data, 
such as filtering, grouping, merging, and more.

On the other hand, a Series is a one-dimensional labeled array capable of holding any data type. 
It is like a single column of a DataFrame and can be considered as the building block of a DataFrame'''

In [5]:
'''Here's a brief comparison between DataFrame and Series:

* DataFrame:

 Two-dimensional structure with rows and columns.
 It can be seen as a collection of Series where each column is a Series.
 Suitable for handling tabular data and performing operations across multiple columns.
 Supports operations that involve multiple columns and rows.'''
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'Salary': [50000, 60000, 75000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

In [9]:
'''
* Series:

 One-dimensional labeled array.
 A single column of a DataFrame or an individual array with labels.
 Suitable for operations that involve a single column of data.
 It can be extracted from a DataFrame using column indexing.'''
import pandas as pd

# Creating a Series
ages = pd.Series([25, 30, 35], name='Naresh')

salaries = pd.Series([50000, 60000, 75000], name='Naresh')

salaries

0    50000
1    60000
2    75000
Name: Naresh, dtype: int64

In [10]:
ages

0    25
1    30
2    35
Name: Naresh, dtype: int64

In [ ]:
'''Question-5'''

In [11]:
# create sample dataframe with missing values
data5 = {'name': ['Naresh', 'Rajesh', 'Lokesh', 'Sneha', 'Devi'],
        'age': [20, 17, None, 21, 21],
        'city': ['Vizag', 'Mumbai', 'Hyderabad', None, 'Tamil Nadu'],
        'category': ['A', 'B', 'A', 'B', 'A'],
        'sales': [400, 200, 250, 150, 450],
        'date': ['2021-12-01', '2021-12-02', '2021-12-03', '2021-12-04', '2021-12-05']}
df5 = pd.DataFrame(data5)
df5

     name   age        city category  sales        date
0  Naresh  20.0       Vizag        A    400  2021-12-01
1  Rajesh  17.0      Mumbai        B    200  2021-12-02
2  Lokesh   NaN   Hyderabad        A    250  2021-12-03
3   Sneha  21.0        None        B    150  2021-12-04
4    Devi  21.0  Tamil Nadu        A    450  2021-12-05

In [12]:
#dropna()
dropped_df5 = df5.dropna(axis=0)
dropped_df5

     name   age        city category  sales        date
0  Naresh  20.0       Vizag        A    400  2021-12-01
1  Rajesh  17.0      Mumbai        B    200  2021-12-02
4    Devi  21.0  Tamil Nadu        A    450  2021-12-05

In [13]:
#fillna()
filled_df5 = df5.fillna(0)
filled_df5

     name   age        city category  sales        date
0  Naresh  20.0       Vizag        A    400  2021-12-01
1  Rajesh  17.0      Mumbai        B    200  2021-12-02
2  Lokesh   0.0   Hyderabad        A    250  2021-12-03
3   Sneha  21.0           0        B    150  2021-12-04
4    Devi  21.0  Tamil Nadu        A    450  2021-12-05

In [14]:
#groupby()
sales_mean = df5.groupby('category').mean(numeric_only=True)
sales_mean

           age       sales
category
A         20.5  366.666667
B         19.0  175.000000

In [15]:
# Sorting by Sales in descending order
df5.sort_values(by='sales',ascending=False)

     name   age        city category  sales        date
4    Devi  21.0  Tamil Nadu        A    450  2021-12-05
0  Naresh  20.0       Vizag        A    400  2021-12-01
2  Lokesh   NaN   Hyderabad        A    250  2021-12-03
1  Rajesh  17.0      Mumbai        B    200  2021-12-02
3   Sneha  21.0        None        B    150  2021-12-04

In [ ]:
'''Question-6'''

In [ ]:
'''In Pandas, both Series and DataFrame are mutable because they are designed to allow modifications to their content. 
This mutability is a key feature that makes these data structures flexible and powerful for data manipulation tasks. 
Here are a few reasons why mutability is beneficial:
    1.Data Manipulation
    2.Efficiency
    3.Convenience
    4.Interactivity'''

'''Pandas Panel is considered immutable because the developers have decided to deprecate it, indicating that it's no longer recommended for use. 
The Panel data structure was designed to handle three-dimensional data, but it had limitations and was less consistent with the rest of the Pandas library.
As a result, the developers introduced alternatives, such as using MultiIndex DataFrames or the xarray library, which provide more flexibility and consistency.''

In [ ]:
'''Question-7'''

In [17]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Full Stack Web Development","Machine Learning","Cloud Computing"])
fees = pd.Series([10000,9500,9000])
discount  = pd.Series([2500,1500,3500])

# concat() supports to combine multiple series.
df7=pd.concat([courses,fees,discount],axis=1)
df7.columns = ['course','fees','discount']
df7

                       course   fees  discount
0  Full Stack Web Development  10000      2500
1            Machine Learning   9500      1500
2             Cloud Computing   9000      3500